ARMmbed/mbed-os/targets/TARGET_TOSHIBA/TARGET_TMPM4G9/device/TMPM4G9.h
/**
  * @brief Interrupt Control B Register
  */
typedef struct
{
       uint8_t  RESERVED0[16];
  __IO uint8_t  NIC00;             /*!< Non maskable interrupt Control Register 00   */
       uint8_t  RESERVED1[79];
  __IO uint8_t  IMC000;            /*!< interrupt Mode Control Register 000          */
  __IO uint8_t  IMC001;            /*!< interrupt Mode Control Register 001          */
  __IO uint8_t  IMC002;            /*!< interrupt Mode Control Register 002          */
  __IO uint8_t  IMC003;            /*!< interrupt Mode Control Register 003          */
  __IO uint8_t  IMC004;            /*!< interrupt Mode Control Register 004          */
  __IO uint8_t  IMC005;            /*!< interrupt Mode Control Register 005          */
  __IO uint8_t  IMC006;            /*!< interrupt Mode Control Register 006          */
  __IO uint8_t  IMC007;            /*!< interrupt Mode Control Register 007          */
  __IO uint8_t  IMC008;            /*!< interrupt Mode Control Register 008          */
  __IO uint8_t  IMC009;            /*!< interrupt Mode Control Register 009          */
  __IO uint8_t  IMC010;            /*!< interrupt Mode Control Register 010          */
  __IO uint8_t  IMC011;            /*!< interrupt Mode Control Register 011          */
  __IO uint8_t  IMC012;            /*!< interrupt Mode Control Register 012          */
  __IO uint8_t  IMC013;            /*!< interrupt Mode Control Register 013          */
  __IO uint8_t  IMC014;            /*!< interrupt Mode Control Register 014          */
  __IO uint8_t  IMC015;            /*!< interrupt Mode Control Register 015          */
  __IO uint8_t  IMC016;            /*!< interrupt Mode Control Register 016          */
  __IO uint8_t  IMC017;            /*!< interrupt Mode Control Register 017          */
  __IO uint8_t  IMC018;            /*!< interrupt Mode Control Register 018          */
  __IO uint8_t  IMC019;            /*!< interrupt Mode Control Register 019          */
  __IO uint8_t  IMC020;            /*!< interrupt Mode Control Register 020          */
  __IO uint8_t  IMC021;            /*!< interrupt Mode Control Register 021          */
  __IO uint8_t  IMC022;            /*!< interrupt Mode Control Register 022          */
  __IO uint8_t  IMC023;            /*!< interrupt Mode Control Register 023          */
  __IO uint8_t  IMC024;            /*!< interrupt Mode Control Register 024          */
  __IO uint8_t  IMC025;            /*!< interrupt Mode Control Register 025          */
  __IO uint8_t  IMC026;            /*!< interrupt Mode Control Register 026          */
  __IO uint8_t  IMC027;            /*!< interrupt Mode Control Register 027          */
  __IO uint8_t  IMC028;            /*!< interrupt Mode Control Register 028          */
  __IO uint8_t  IMC029;            /*!< interrupt Mode Control Register 029          */
  __IO uint8_t  IMC030;            /*!< interrupt Mode Control Register 030          */
  __IO uint8_t  IMC031;            /*!< interrupt Mode Control Register 031          */
  __IO uint8_t  IMC032;            /*!< interrupt Mode Control Register 032          */
  __IO uint8_t  IMC033;            /*!< interrupt Mode Control Register 033          */
  __IO uint8_t  IMC034;            /*!< interrupt Mode Control Register 034          */
  __IO uint8_t  IMC035;            /*!< interrupt Mode Control Register 035          */
  __IO uint8_t  IMC036;            /*!< interrupt Mode Control Register 036          */
  __IO uint8_t  IMC037;            /*!< interrupt Mode Control Register 037          */
  __IO uint8_t  IMC038;            /*!< interrupt Mode Control Register 038          */
  __IO uint8_t  IMC039;            /*!< interrupt Mode Control Register 039          */
  __IO uint8_t  IMC040;            /*!< interrupt Mode Control Register 040          */
  __IO uint8_t  IMC041;            /*!< interrupt Mode Control Register 041          */
  __IO uint8_t  IMC042;            /*!< interrupt Mode Control Register 042          */
  __IO uint8_t  IMC043;            /*!< interrupt Mode Control Register 043          */
  __IO uint8_t  IMC044;            /*!< interrupt Mode Control Register 044          */
  __IO uint8_t  IMC045;            /*!< interrupt Mode Control Register 045          */
  __IO uint8_t  IMC046;            /*!< interrupt Mode Control Register 046          */
  __IO uint8_t  IMC047;            /*!< interrupt Mode Control Register 047          */
  __IO uint8_t  IMC048;            /*!< interrupt Mode Control Register 048          */
  __IO uint8_t  IMC049;            /*!< interrupt Mode Control Register 049          */
  __IO uint8_t  IMC050;            /*!< interrupt Mode Control Register 050          */
  __IO uint8_t  IMC051;            /*!< interrupt Mode Control Register 051          */
  __IO uint8_t  IMC052;            /*!< interrupt Mode Control Register 052          */
  __IO uint8_t  IMC053;            /*!< interrupt Mode Control Register 053          */
  __IO uint8_t  IMC054;            /*!< interrupt Mode Control Register 054          */
  __IO uint8_t  IMC055;            /*!< interrupt Mode Control Register 055          */
  __IO uint8_t  IMC056;            /*!< interrupt Mode Control Register 056          */
  __IO uint8_t  IMC057;            /*!< interrupt Mode Control Register 057          */
  __IO uint8_t  IMC058;            /*!< interrupt Mode Control Register 058          */
  __IO uint8_t  IMC059;            /*!< interrupt Mode Control Register 059          */
  __IO uint8_t  IMC060;            /*!< interrupt Mode Control Register 060          */
  __IO uint8_t  IMC061;            /*!< interrupt Mode Control Register 061          */
  __IO uint8_t  IMC062;            /*!< interrupt Mode Control Register 062          */
  __IO uint8_t  IMC063;            /*!< interrupt Mode Control Register 063          */
  __IO uint8_t  IMC064;            /*!< interrupt Mode Control Register 064          */
  __IO uint8_t  IMC065;            /*!< interrupt Mode Control Register 065          */
  __IO uint8_t  IMC066;            /*!< interrupt Mode Control Register 066          */
  __IO uint8_t  IMC067;            /*!< interrupt Mode Control Register 067          */
  __IO uint8_t  IMC068;            /*!< interrupt Mode Control Register 068          */
  __IO uint8_t  IMC069;            /*!< interrupt Mode Control Register 069          */
  __IO uint8_t  IMC070;            /*!< interrupt Mode Control Register 070          */
  __IO uint8_t  IMC071;            /*!< interrupt Mode Control Register 071          */
  __IO uint8_t  IMC072;            /*!< interrupt Mode Control Register 072          */
  __IO uint8_t  IMC073;            /*!< interrupt Mode Control Register 073          */
  __IO uint8_t  IMC074;            /*!< interrupt Mode Control Register 074          */
  __IO uint8_t  IMC075;            /*!< interrupt Mode Control Register 075          */
  __IO uint8_t  IMC076;            /*!< interrupt Mode Control Register 076          */
  __IO uint8_t  IMC077;            /*!< interrupt Mode Control Register 077          */
  __IO uint8_t  IMC078;            /*!< interrupt Mode Control Register 078          */
  __IO uint8_t  IMC079;            /*!< interrupt Mode Control Register 079          */
  __IO uint8_t  IMC080;            /*!< interrupt Mode Control Register 080          */
  __IO uint8_t  IMC081;            /*!< interrupt Mode Control Register 081          */
  __IO uint8_t  IMC082;            /*!< interrupt Mode Control Register 082          */
  __IO uint8_t  IMC083;            /*!< interrupt Mode Control Register 083          */
  __IO uint8_t  IMC084;            /*!< interrupt Mode Control Register 084          */
  __IO uint8_t  IMC085;            /*!< interrupt Mode Control Register 085          */
  __IO uint8_t  IMC086;            /*!< interrupt Mode Control Register 086          */
  __IO uint8_t  IMC087;            /*!< interrupt Mode Control Register 087          */
  __IO uint8_t  IMC088;            /*!< interrupt Mode Control Register 088          */
  __IO uint8_t  IMC089;            /*!< interrupt Mode Control Register 089          */
  __IO uint8_t  IMC090;            /*!< interrupt Mode Control Register 090          */
  __IO uint8_t  IMC091;            /*!< interrupt Mode Control Register 091          */
  __IO uint8_t  IMC092;            /*!< interrupt Mode Control Register 092          */
  __IO uint8_t  IMC093;            /*!< interrupt Mode Control Register 093          */
  __IO uint8_t  IMC094;            /*!< interrupt Mode Control Register 094          */
  __IO uint8_t  IMC095;            /*!< interrupt Mode Control Register 095          */
  __IO uint8_t  IMC096;            /*!< interrupt Mode Control Register 096          */
  __IO uint8_t  IMC097;            /*!< interrupt Mode Control Register 097          */
  __IO uint8_t  IMC098;            /*!< interrupt Mode Control Register 098          */
  __IO uint8_t  IMC099;            /*!< interrupt Mode Control Register 099          */
  __IO uint8_t  IMC100;            /*!< interrupt Mode Control Register 100          */
  __IO uint8_t  IMC101;            /*!< interrupt Mode Control Register 101          */
  __IO uint8_t  IMC102;            /*!< interrupt Mode Control Register 102          */
  __IO uint8_t  IMC103;            /*!< interrupt Mode Control Register 103          */
  __IO uint8_t  IMC104;            /*!< interrupt Mode Control Register 104          */
  __IO uint8_t  IMC105;            /*!< interrupt Mode Control Register 105          */
  __IO uint8_t  IMC106;            /*!< interrupt Mode Control Register 106          */
  __IO uint8_t  IMC107;            /*!< interrupt Mode Control Register 107          */
  __IO uint8_t  IMC108;            /*!< interrupt Mode Control Register 108          */
  __IO uint8_t  IMC109;            /*!< interrupt Mode Control Register 109          */
  __IO uint8_t  IMC110;            /*!< interrupt Mode Control Register 110          */
  __IO uint8_t  IMC111;            /*!< interrupt Mode Control Register 111          */
  __IO uint8_t  IMC112;            /*!< interrupt Mode Control Register 112          */
  __IO uint8_t  IMC113;            /*!< interrupt Mode Control Register 113          */
  __IO uint8_t  IMC114;            /*!< interrupt Mode Control Register 114          */
  __IO uint8_t  IMC115;            /*!< interrupt Mode Control Register 115          */
  __IO uint8_t  IMC116;            /*!< interrupt Mode Control Register 116          */
  __IO uint8_t  IMC117;            /*!< interrupt Mode Control Register 117          */
  __IO uint8_t  IMC118;            /*!< interrupt Mode Control Register 118          */
  __IO uint8_t  IMC119;            /*!< interrupt Mode Control Register 119          */
  __IO uint8_t  IMC120;            /*!< interrupt Mode Control Register 120          */
  __IO uint8_t  IMC121;            /*!< interrupt Mode Control Register 121          */
  __IO uint8_t  IMC122;            /*!< interrupt Mode Control Register 122          */
  __IO uint8_t  IMC123;            /*!< interrupt Mode Control Register 123          */
  __IO uint8_t  IMC124;            /*!< interrupt Mode Control Register 124          */
  __IO uint8_t  IMC125;            /*!< interrupt Mode Control Register 125          */
  __IO uint8_t  IMC126;            /*!< interrupt Mode Control Register 126          */
  __IO uint8_t  IMC127;            /*!< interrupt Mode Control Register 127          */
  __IO uint8_t  IMC128;            /*!< interrupt Mode Control Register 128          */
  __IO uint8_t  IMC129;            /*!< interrupt Mode Control Register 129          */
  __IO uint8_t  IMC130;            /*!< interrupt Mode Control Register 130          */
  __IO uint8_t  IMC131;            /*!< interrupt Mode Control Register 131          */
  __IO uint8_t  IMC132;            /*!< interrupt Mode Control Register 132          */
  __IO uint8_t  IMC133;            /*!< interrupt Mode Control Register 133          */
  __IO uint8_t  IMC134;            /*!< interrupt Mode Control Register 134          */
  __IO uint8_t  IMC135;            /*!< interrupt Mode Control Register 135          */
  __IO uint8_t  IMC136;            /*!< interrupt Mode Control Register 136          */
  __IO uint8_t  IMC137;            /*!< interrupt Mode Control Register 137          */
  __IO uint8_t  IMC138;            /*!< interrupt Mode Control Register 138          */
  __IO uint8_t  IMC139;            /*!< interrupt Mode Control Register 139          */
  __IO uint8_t  IMC140;            /*!< interrupt Mode Control Register 140          */
  __IO uint8_t  IMC141;            /*!< interrupt Mode Control Register 141          */
} TSB_IB_TypeDef;

/**
  * @brief Interrupt Monitor Register
  */
typedef struct
{
  __I  uint32_t FLGNMI;            /*!< NMI Interrupt Monitor Flag 0                 */
  __I  uint32_t FLG1;              /*!< Interrupt Monitor Flag 1 (032 - 063)         */
  __I  uint32_t FLG2;              /*!< Interrupt Monitor Flag 2 (064 - 095)         */
  __I  uint32_t FLG3;              /*!< Interrupt Monitor Flag 3 (096 - 127)         */
  __I  uint32_t FLG4;              /*!< Interrupt Monitor Flag 4 (128 - 159)         */
  __I  uint32_t FLG5;              /*!< Interrupt Monitor Flag 5 (160 - 191)         */
  __I  uint32_t FLG6;              /*!< Interrupt Monitor Flag 6 (192 - 223)         */
  __I  uint32_t FLG7;              /*!< Interrupt Monitor Flag 7 (224 - 225)         */
} TSB_IMN_TypeDef;

/**
  * @brief DNF
  */
typedef struct
{
  __IO uint32_t CKCR;              /*!< DNF clock Control register                   */
  __IO uint32_t ENCR;              /*!< DNF Enable register                          */
} TSB_DNF_TypeDef;

/**
  * @brief Watchdog Timer (WD)
  */
typedef struct
{
  __IO uint32_t PRO;               /*!< SIWD Protect Register                        */
  __IO uint32_t EN;                /*!< SIWD Enable Register                         */
  __O  uint32_t CR;                /*!< SIWD Control Register                        */
  __IO uint32_t MOD;               /*!< SIWD Mode Register                           */
  __I  uint32_t MONI;              /*!< SIWD Monitor Register                        */
} TSB_SIWD_TypeDef;

/**
  * @brief NBD
  */
typedef struct
{
  __IO uint32_t CR0;               /*!< NBD control register 0                       */
  __IO uint32_t CR1;               /*!< NBD control register 1                       */
} TSB_NBD_TypeDef;

